Desktop.org
#+title: Linas' Emacs Desktop Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./desktop.el

* Prerequisites
** Desktop Enviroment Prerequisites

- xset
- setxkbmap

- picom
- nitrogen

- xss-lock
- slock

- brightnessctl for controlling the brightness
- playerctl
- scrot for screenshots

- polybar

- dunst
- dunstctl

** Desktop Applications

(Not necesarry, only helpfull if you want an email client, and a well intregrated browser for your EXWM)

- mu (install it or delete it's code from desktop applications section)
- qutebrowser
  
* Desktop Enviroment
** Desktop File *Only if using login manager*

*Only used by a login manager, if no login manager do not tangle*

This file is used by yout "login manager" (GDM, LightDM, etc) to display EXWM as a desktop enviroment option when you log in.

*IMPORTANT*: Make sure you create a symbolic link for this file into =/usr/share/xsessions=:

#+begin_src sh :tangle no

  sudo ln -f ~/.emacs.d/exwm/EXWM.desktop /usr/share/xsessions/EXWM.desktop

#+end_src

#+begin_src shell :tangle ./exwm/EXWM.desktop :mkdirp yes

[Desktop Entry]
NAME=EXWM
Comment=Emacs Window Manager
Exec=sh ~/.emacs.d/exwm/start-exwm.sh
TryExec=sh
Type=Application
DesktopNames=exwm

#+end_src

** Launcher Script

If not using a login manager you can directly tangle to ~~/.xinitrc~

#+begin_src sh :tangle ./exwm/start-exwm.sh :shebang #!/bin/sh

  # Setting faster typing
  xset r rate 200 75

  # Converting caps lock to ctrl
  setxkbmap -option "ctrl:nocaps"

  # Startup picom
  picom &

  # Resotring previous wallpaper
  # Not needed in the launcher script. Launching at exwm startup
  # nitrogen --restore &

  # Enable screen locking on suspend
  xss-lock -- slock &

  # Fire it up
  # -mm - maximize window
  # --debug-init - as init.el is loading if hit any errors drop into the debugger
  exec dbus-launch --exit-with-session emacs -mm --debug-init -l ~/.emacs.d/desktop.el

#+end_src

** DPI Configuration

The =Xresources= file will be used with =xrdb= in =start-exwm.sh= to set our screen DPI:
*Currently not in use*

#+begin_src conf :tangle ./exwm/Xresources

  Xft.dpi: 100 # Set this to your desired DPI! Larger number means bigger text and UI.

#+end_src

** Maximize Emacs on startup

#+begin_src emacs-lisp

  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

** Desktop environment package

*DEPENDENCIES*

- brignessctl for controlling the brightness
- playerctl
- scrot for screenshots
- amixer for controlling volume
  
#+begin_src emacs-lisp

  (use-package desktop-environment
    :after exwm
    :config

    ;; Rebinding dekstop-environment-lock-screen form s-l to s-L for integration with windowmove keybinds
    (define-key desktop-environment-mode-map (kbd "s-l") nil)
    (define-key desktop-environment-mode-map (kbd "s-L") #'desktop-environment-lock-screen)

    (desktop-environment-mode)
    :custom
    ;; Brightness increments and decrements
    (desktop-environment-brightness-small-increment "1%+")
    (desktop-environment-brightness-small-decrement "1%-")
    (desktop-environment-brightness-normal-increment "5%+")
    (desktop-environment-brightness-normal-decrement "5%-")

    ;; Volume increments and decrements
    (desktop-environment-volume-small-increment "1%+")
    (desktop-environment-volume-small-decrement "1%-")
    (desktop-environment-volume-normal-increment "5%+")
    (desktop-environment-volume-normal-decrement "5%-"))

#+end_src

** Locking the scren

Using slock and xss-lock. Added to startup file.

*DEPENDENCIES*
- xss-lock
- slock
  
Void Linux (xbps):
#+begin_src sh

  sudo xbps-install slock xss-lock

#+end_src

Arch Linux:

#+begin_src shell

  sudo pacman -S slock xss-lock

#+end_src

Ubuntu (apt):
#+begin_src sh

  sudo apt install slock xss-lock

#+end_src

** Polybar
*** Installation

Void Linux:

#+begin_src sh

  sudo xbps-install polybar

#+end_src

Arch: Use yay to install. or just clone git

#+begin_src sh

  yay -S polybar-git

#+end_src


Also install some icon fonts:

Void Linux:

#+begin_src sh

  sudo xbps-install font-awesome font-material-design-icons-ttf

#+end_src

*** Basic Polybar config
#+begin_src conf :tangle ~/.config/polybar/config :mkdirp yes

  ; Docs: https://github.com/polybar/polybar
  ;==========================================================

  [settings]
  screenchange-reload = true

  [global/wm]
  margin-top = 0
  margin-bottom = 0

  [colors]
  background = #f0232635
  background-alt = #576075
  foreground = #A6Accd
  foreground-alt = #555
  primary = #ffb52a
  secondary = #e60053
  alert = #bd2c40
  underline-1 = #c792ea

  [bar/panel]
  width = 100%
  height = 25
  offset-x = 0
  offset-y = 0
  fixed-center = true
  enable-ipc = true

  background = ${colors.background}
  foreground = ${colors.foreground}

  line-size = 2
  line-color = #f00

  border-size = 0
  border-color = #00000000

  padding-top = 5
  padding-left = 1
  padding-right = 1

  module-margin = 1

  font-0 = "Cantarell:size=14:weight=bold;2"
  font-1 = "Font Awesome:size=14;2"
  font-2 = "Material Icons:size=18;5"
  font-3 = "Fira Mono:size=13;-3"

  modules-left = exwm-workspace
  modules-right = cpu temperature battery date

  tray-position = right
  tray-padding = 2
  tray-maxsize = 28

  cursor-click = pointer
  cursor-scroll = ns-resize

  [module/exwm-workspace]
  type = custom/ipc
  hook-0 = emacsclient -e "exwm-workspace-current-index" | sed -e 's/^"//' -e 's/"$//'
  initial = 1
  format-underline = ${colors.underline-1}
  format-padding = 1

  [module/cpu]
  type = internal/cpu
  interval = 1
  format = <label> <ramp-coreload>
  format-underline = ${colors.underline-1}
  click-left = emacsclient -e "(proced)"
  label = %percentage:2%%
  ramp-coreload-spacing = 0
  ramp-coreload-0 = ▁
  ramp-coreload-0-foreground = ${colors.foreground-alt}
  ramp-coreload-1 = ▂
  ramp-coreload-2 = ▃
  ramp-coreload-3 = ▄
  ramp-coreload-4 = ▅
  ramp-coreload-5 = ▆
  ramp-coreload-6 = ▇

  [module/date]
  type = internal/date
  interval = 5

  date = "%d/%m/%y"
  date-alt = "%a %d/%m/%y"

  time = %H:%M
  time-alt = %H:%M:%S

  format-prefix-foreground = ${colors.foreground-alt}
  format-underline = ${colors.underline-1}

  label = %date% %time%

  [module/battery]
  type = internal/battery
  battery = BAT0
  adapter = ADP1
  full-at = 98
  time-format = %-l:%M

  label-charging = %percentage%% / %time%
  format-charging = <animation-charging> <label-charging>
  format-charging-underline = ${colors.underline-1}

  label-discharging = %percentage%% / %time%
  format-discharging = <ramp-capacity> <label-discharging>
  format-discharging-underline = ${self.format-charging-underline}

  format-full = <ramp-capacity> <label-full>
  format-full-underline = ${self.format-charging-underline}

  ramp-capacity-0 = 
  ramp-capacity-1 = 
  ramp-capacity-2 = 
  ramp-capacity-3 = 
  ramp-capacity-4 = 

  animation-charging-0 = 
  animation-charging-1 = 
  animation-charging-2 = 
  animation-charging-3 = 
  animation-charging-4 = 
  animation-charging-framerate = 750

  [module/temperature]
  type = internal/temperature
  ; Thermal zone to use
  ; To list all the zone types, run 
  ; $ for i in  /sys/class/thermal/thermal_zone*; do echo "$i: $(<$i/type)"; cat $i/temp; done
  thermal-zone = 1
  warn-temperature = 60

  format = <label>
  format-underline = ${colors.underline-1}
  format-warn = <label-warn>
  format-warn-underline = ${self.format-underline}

  label = %temperature-c%
  label-warn = %temperature-c%!
  label-warn-foreground = ${colors.secondary}


#+end_src

*** Starting Polybar

#+begin_src emacs-lisp

  (defvar linas/polybar-process nil
    "Holds the process of the running Polybar instance, if any")

#+end_src

*** Polybar functions
**** Kill panel
#+begin_src emacs-lisp

  (defun linas/kill-panel ()
    (interactive)
    (when linas/polybar-process
      (ignore-errors
        (kill-process linas/polybar-process))))

#+end_src

**** Start panel
#+begin_src emacs-lisp

  (defun linas/start-panel ()
    (interactive)
    (linas/kill-panel)
    (setq linas/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

#+end_src

**** Send Polybar hook
#+begin_src emacs-lisp

  (defun linas/send-polybar-hook (module-name hook-index)
    (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

#+end_src

**** Send Polybar EXWM workspace
#+begin_src emacs-lisp

  (defun linas/send-polybar-exwm-workspace ()
    (linas/send-polybar-hook "exwm-workspace" 1))

#+end_src

*** Hooking Emacs to Polybar
#+begin_src emacs-lisp

  ;; Update panel indicator when workspace changes
  (add-hook 'exwm-workspace-switch-hook #'linas/send-polybar-exwm-workspace)

#+end_src

** Desktop Notifications with Dunst

*Dependencies*
  - Dunst

*** Installation
Void Linux:
#+begin_src sh

  sudo xbps-install dunst

#+end_src

