desktop.el
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(use-package desktop-environment
  :after exwm
  :config

  ;; Rebinding dekstop-environment-lock-screen form s-l to s-L for integration with windowmove keybinds
  (define-key desktop-environment-mode-map (kbd "s-l") nil)
  (define-key desktop-environment-mode-map (kbd "s-L") #'desktop-environment-lock-screen)

  (desktop-environment-mode)
  :custom
  ;; Brightness increments and decrements
  (desktop-environment-brightness-small-increment "1%+")
  (desktop-environment-brightness-small-decrement "1%-")
  (desktop-environment-brightness-normal-increment "5%+")
  (desktop-environment-brightness-normal-decrement "5%-")

  ;; Volume increments and decrements
  (desktop-environment-volume-small-increment "1%+")
  (desktop-environment-volume-small-decrement "1%-")
  (desktop-environment-volume-normal-increment "5%+")
  (desktop-environment-volume-normal-decrement "5%-"))

(defvar linas/polybar-process nil
  "Holds the process of the running Polybar instance, if any")

(defun linas/kill-panel ()
  (interactive)
  (when linas/polybar-process
    (ignore-errors
      (kill-process linas/polybar-process))))

(defun linas/start-panel ()
  (interactive)
  (linas/kill-panel)
  (setq linas/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

(defun linas/send-polybar-hook (module-name hook-index)
  (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

(defun linas/send-polybar-exwm-workspace ()
  (linas/send-polybar-hook "exwm-workspace" 1))

;; Update panel indicator when workspace changes
(add-hook 'exwm-workspace-switch-hook #'linas/send-polybar-exwm-workspace)
