Desktop.org
*** Dunst configuration
#+begin_src conf :tangle ~/.config/dunst/dunstrc :mkdirp yes

  [global]
      ### Display ###
      monitor = 0

      # The geometry of the window:
      #   [{width}]x{height}[+/-{x}+/-{y}]
      geometry = "300x10-10+30"

      # Show how many messages are currently hidden (because of geometry).
      indicate_hidden = yes

      # Shrink window if it's smaller than the width.  Will be ignored if
      # width is 0.
      shrink = no

      # The transparency of the window.  Range: [0; 100].
      transparency = 10

      # The height of the entire notification.  If the height is smaller
      # than the font height and padding combined, it will be raised
      # to the font height and padding.
      notification_height = 0

      # Draw a line of "separator_height" pixel height between two
      # notifications.
      # Set to 0 to disable.
      separator_height = 1
      separator_color = frame

      # Padding between text and separator.
      padding = 8

      # Horizontal padding.
      horizontal_padding = 8

      # Defines width in pixels of frame around the notification window.
      # Set to 0 to disable.
      frame_width = 2

      # Defines color of the frame around the notification window.
      frame_color = "#89AAEB"

      # Sort messages by urgency.
      sort = yes

      # Don't remove messages, if the user is idle (no mouse or keyboard input)
      # for longer than idle_threshold seconds.
      idle_threshold = 30

      ### Text ###

      font = Cantarell 12

      # The spacing between lines.  If the height is smaller than the
      # font height, it will get raised to the font height.
      line_height = 0
      markup = full

      # The format of the message.  Possible variables are:
      #   %a  appname
      #   %s  summary
      #   %b  body
      #   %i  iconname (including its path)
      #   %I  iconname (without its path)
      #   %p  progress value if set ([  0%] to [100%]) or nothing
      #   %n  progress value if set without any extra characters
      #   %%  Literal %
      # Markup is allowed
      format = "<b>%s</b>\n%b"

      # Alignment of message text.
      # Possible values are "left", "center" and "right".
      alignment = left

      # Show age of message if message is older than show_age_threshold
      # seconds.
      # Set to -1 to disable.
      show_age_threshold = 15

      # Split notifications into multiple lines if they don't fit into
      # geometry.
      word_wrap = yes

      # When word_wrap is set to no, specify where to make an ellipsis in long lines.
      # Possible values are "start", "middle" and "end".
      ellipsize = middle

      # Ignore newlines '\n' in notifications.
      ignore_newline = no

      # Stack together notifications with the same content
      stack_duplicates = true

      # Hide the count of stacked notifications with the same content
      hide_duplicate_count = false

      # Display indicators for URLs (U) and actions (A).
      show_indicators = yes

      ### Icons ###

      # Align icons left/right/off
      icon_position = left

      # Scale larger icons down to this size, set to 0 to disable
      max_icon_size = 88

      # Paths to default icons. Use : to add multiple paths
    icon_path = /usr/share/icons/Adwaita/48x48/emblems:/usr/share/icons/Adwaita/48x48/status

      ### History ###

      # Should a notification popped up from history be sticky or timeout
      # as if it would normally do.
      sticky_history = no

      # Maximum amount of notifications kept in history
      history_length = 20

      ### Misc/Advanced ###

      # Browser for opening urls in context menu.
      browser = qutebrowser

      # Always run rule-defined scripts, even if the notification is suppressed
      always_run_script = true

      # Define the title of the windows spawned by dunst
      title = Dunst

      # Define the class of the windows spawned by dunst
      class = Dunst

      startup_notification = false
      verbosity = mesg

      # Define the corner radius of the notification window
      # in pixel size. If the radius is 0, you have no rounded
      # corners.
      # The radius will be automatically lowered if it exceeds half of the
      # notification height to avoid clipping text and/or icons.
      corner_radius = 4

      mouse_left_click = close_current
      mouse_middle_click = do_action
      mouse_right_click = close_all

  # Experimental features that may or may not work correctly. Do not expect them
  # to have a consistent behaviour across releases.
  [experimental]
      # Calculate the dpi to use on a per-monitor basis.
      # If this setting is enabled the Xft.dpi value will be ignored and instead
      # dunst will attempt to calculate an appropriate dpi value for each monitor
      # using the resolution and physical size. This might be useful in setups
      # where there are multiple screens with very different dpi values.
      per_monitor_dpi = false

  [shortcuts]

      # Shortcuts are specified as [modifier+][modifier+]...key
      # Available modifiers are "ctrl", "mod1" (the alt-key), "mod2",
      # "mod3" and "mod4" (windows-key).
      # Xev might be helpful to find names for keys.

      # Close notification.
      #close = ctrl+space

      # Close all notifications.
      #close_all = ctrl+shift+space

      # Redisplay last message(s).
      # On the US keyboard layout "grave" is normally above TAB and left
      # of "1". Make sure this key actually exists on your keyboard layout,
      # e.g. check output of 'xmodmap -pke'
      history = ctrl+grave

      # Context menu.
      context = ctrl+shift+period

  [urgency_low]
      # IMPORTANT: colors have to be defined in quotation marks.
      # Otherwise the "#" and following would be interpreted as a comment.
      background = "#222222"
      foreground = "#888888"
      timeout = 10
      # Icon for notifications with low urgency, uncomment to enable
      #icon = /path/to/icon

  [urgency_normal]
      background = "#1c1f26"
      foreground = "#ffffff"
      timeout = 10
      # Icon for notifications with normal urgency, uncomment to enable
      #icon = /path/to/icon

  [urgency_critical]
      background = "#900000"
      foreground = "#ffffff"
      frame_color = "#ff0000"
      timeout = 0
      # Icon for notifications with critical urgency, uncomment to enable
      #icon = /path/to/icon

#+end_src

*** Control Dunst with dunstctl

#+begin_src emacs-lisp

  (defun linas/dunstctl (command)
    (start-process-shell-command "dunstctl" nil (concat "dunstctl " command)))

#+end_src

*** Interactive funtions to enable/disable notifications

#+begin_src emacs-lisp

  (defun linas/desktop-notifications-enable ()
    (interactive)
    (linas/dunstctl "set-paused false"))

  (defun linas/desktop-notifications-disable ()
    (interactive)
    (linas/dunstctl "set-paused true"))

  (defun linas/desktop-notifications-toggle ()
    (interactive)
    (linas/dunstctl "set-paused toggle"))

#+end_src

** Keyboard layout switching

Function for switching keyboard layout

#+begin_src emacs-lisp

  (defun linas/switch-keyboard-layout (to_layout)
    "Function to switch between keyboard layouts"
    (interactive
     (list (completing-read "MSwitch keybaord layout to: "
                            '(("us") ("no") ("lt")) nil t)))
    (start-process-shell-command "setxkbmap" nil (format "setxkbmap %s" to_layout)))

  ;; later use for polybar to display keyboard layout
  (defun linas/get-keyboard-layout ()
    (interactive))

#+end_src

* Window Management
** EXWM Functions
*** Run in background

#+begin_src emacs-lisp

  (defun linas/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

#+end_src

*** EXWM Init hook

#+begin_src emacs-lisp

  (defun linas/exwm-init-hook ()
    ;;   Make workspace 1 to be the one where we land at startup
    ;;   (exwm-workspace-switch-create 1)

    ;;   Open eshell by defaul
    ;;   (eshell)

    ;;Launch apps that will run in the background
    (linas/run-in-background "nm-applet")
    (linas/run-in-background "pasystray")
    (linas/run-in-background "blueman-applet")
    (linas/run-in-background "dunst"))

  ;; Start the Polybar panel
  (linas/start-panel)

#+end_src

*** EXWM Update Class

#+begin_src emacs-lisp

  (defun linas/exwm-update-class ()
     (exwm-workspace-rename-buffer exwm-class-name))

#+end_src

*** EXWM Update Title

#+begin_src emacs-lisp

  (defun linas/exwm-update-title-firefox-remove-double-name ()
    (if (string-match-p " — Mozilla Firefox\\'" exwm-title)
        (substring exwm-title 0 (string-match-p " — Mozilla Firefox\\'" exwm-title))
      exwm-title))

  ;; Not finished, maninly cuz im retarded
  ;; (defun linas/exwm-update-title-firefox ()
  ;;   (interactive)
  ;; (message (length (linas/exwm-update-title-firefox-remove-double-name)))
  ;;   (if (> (length linas/exwm-update-title-firefox-remove-double-name) 60)
  ;;       (concat (substring exwm-title 0 60) "...")
  ;;     (linas/exwm-update-title-firefox-remove-double-name)))

#+end_src

#+begin_src emacs-lisp

  (defun linas/exwm-update-title ()
    (pcase exwm-class-name
      ("Firefox"
       (exwm-workspace-rename-buffer
        (format "Firefox: %s" (linas/exwm-update-title-firefox-remove-double-name))))))
          
#+end_src

*** Configure window by class

#+begin_src emacs-lisp

  (defun linas/configure-window-by-class ()
    (interactive)
    ;; (message "Window '%s' appeared!" exwm-class-name)
    (pcase exwm-class-name
      ("mpv" (exwm-floating-toggle-floating)
       (exwm-layout-toggle-mode-line))
      ("Firefox" (exwm-workspace-move-window 0))))

#+end_src

*** Position window

#+begin_src emacs-lisp

  (defun linas/position-window ()
    (let* ((pos (frame-position)
             (pos-x (car pos))
             (pos-y (cdr pos)))

          (exwm-floating-move (- pos-x) (- pos-y)))))

#+end_src

*** Set wallpaper

#+begin_src emacs-lisp

  (defun linas/set-wallpaper ()
    (interactive)
    (start-process-shell-command
     "nitrogen" nil "nitrogen --restore"))

#+end_src

