desktop.el

(defun linas/dunstctl (command)
  (start-process-shell-command "dunstctl" nil (concat "dunstctl " command)))

(defun linas/desktop-notifications-enable ()
  (interactive)
  (linas/dunstctl "set-paused false"))

(defun linas/desktop-notifications-disable ()
  (interactive)
  (linas/dunstctl "set-paused true"))

(defun linas/desktop-notifications-toggle ()
  (interactive)
  (linas/dunstctl "set-paused toggle"))

(defun linas/switch-keyboard-layout (to_layout)
  "Function to switch between keyboard layouts"
  (interactive
   (list (completing-read "MSwitch keybaord layout to: "
                          '(("us") ("no") ("lt")) nil t)))
  (start-process-shell-command "setxkbmap" nil (format "setxkbmap %s" to_layout)))

;; later use for polybar to display keyboard layout
(defun linas/get-keyboard-layout ()
  (interactive))

(use-package ncla
  :straight '(NCLA :host github :repo "LinasVidziunas/NCLA"))

(defun linas/run-in-background (command)
  (let ((command-parts (split-string command "[ ]+")))
    (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

(defun linas/exwm-init-hook ()
  ;;   Make workspace 1 to be the one where we land at startup
  ;;   (exwm-workspace-switch-create 1)

  ;;   Open eshell by defaul
  ;;   (eshell)

  ;;Launch apps that will run in the background
  (linas/run-in-background "nm-applet")
  (linas/run-in-background "pasystray")
  (linas/run-in-background "blueman-applet")
  (linas/run-in-background "dunst"))

;; Start the Polybar panel
(linas/start-panel)

(defun linas/exwm-update-class ()
   (exwm-workspace-rename-buffer exwm-class-name))

(defun linas/exwm-update-title-firefox-remove-double-name ()
  (if (string-match-p " — Mozilla Firefox\\'" exwm-title)
      (substring exwm-title 0 (string-match-p " — Mozilla Firefox\\'" exwm-title))
    exwm-title))

;; Not finished, maninly cuz im retarded
;; (defun linas/exwm-update-title-firefox ()
;;   (interactive)
;; (message (length (linas/exwm-update-title-firefox-remove-double-name)))
;;   (if (> (length linas/exwm-update-title-firefox-remove-double-name) 60)
;;       (concat (substring exwm-title 0 60) "...")
;;     (linas/exwm-update-title-firefox-remove-double-name)))

(defun linas/exwm-update-title ()
  (pcase exwm-class-name
    ("Firefox"
     (exwm-workspace-rename-buffer
      (format "Firefox: %s" (linas/exwm-update-title-firefox-remove-double-name))))))

(defun linas/configure-window-by-class ()
  (interactive)
  ;; (message "Window '%s' appeared!" exwm-class-name)
  (pcase exwm-class-name
    ("mpv" (exwm-floating-toggle-floating)
     (exwm-layout-toggle-mode-line))
    ("Firefox" (exwm-workspace-move-window 0))))

(defun linas/position-window ()
  (let* ((pos (frame-position)
           (pos-x (car pos))
           (pos-y (cdr pos)))

        (exwm-floating-move (- pos-x) (- pos-y)))))

(defun linas/set-wallpaper ()
  (interactive)
  (start-process-shell-command
   "nitrogen" nil "nitrogen --restore"))
