Desktop.org
** EXWM Configuration

#+begin_src emacs-lisp

  (use-package exwm
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 10)

    ;; Automatically move EXWM buffer to current workspace when slected
    ;; exwm-switch-to-buffer 
    ;; (setq exwm-layout-show-all-buffers t)

    ;; Display all EXWM buffers in every workspace buffer list
    ;; (setq exwm-workspace-show-all-buffers t) 

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'linas/exwm-update-class)

    ;; When window title updates, use it to set the buffer name
    (add-hook 'exwm-update-title-hook #'linas/exwm-update-title)

    ;; When EXWM starts up, do some extra configuration
    (add-hook 'exwm-init-hook #'linas/exwm-init-hook)

    ;; Set the screen resolution
    (require 'exwm-randr)
    (exwm-randr-enable)
    (start-process-shell-command "xrandr" nil "xrandr --output eDP1 --primary --mode 1920x1080 --pos 0x0 --rotate normal")

    (linas/set-wallpaper)

    ;; Load the system tray before exwm-init
    ;; Commented out because using polybar
    ;; (require 'exwm-systemtray)
    ;; (setq exwm-systemtray-height 20)
    ;; (exwm-systemtray-enable)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-u
            ?\C-h
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\M-j  ;; Buffer list
            ?\C-\ ))  ;; Ctrl+Space

    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          `(
            ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
            ([?\s-r] . exwm-reset)

            ;; Move between windows
            ([?\s-h] . windmove-left)
            ([?\s-l] . windmove-right)
            ([?\s-k] . windmove-up)
            ([?\s-j] . windmove-down)

            ;; Launch applications via shell command
            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Switch workspace
            ;;([?\s-w] . exwm-workspace-switch)

            ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

    ;; (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)
    (exwm-input-set-key (kbd "s-f") 'exwm-layout-toggle-fullscreen)

    (exwm-input-set-key (kbd "s-n") (lambda () (interactive) (linas/dunstctl "history-pop")))
    (exwm-input-set-key (kbd "s-N") (lambda () (interactive) (linas/dunstctl "close-all")))

    (exwm-enable))

#+end_src

* Desktop Applications
** Password Encryption

*Living nightmare currently*

For pass to work with firefox on void.
I installed ~browserpass~ on void and also the ~browserpass~ firefox extenion.
Also installed ~pinentry-emacs~

*** Authentication Sources

The =auth-source= library looks for passwords in a set of sources configured by the variable =auth-sources.=

By default it looks at:

- =~/.authinfo.gpg=
- =~/.authinfo=
- =~/.netrc=

*** The .authinfo file

Passwords stored in a file named =~/.authinfo= in this format, one per line:

#+begin_src conf

  machine facebook.com login zuck password w0rldd0m1n4ti0n
  machine mailprovider.com login mailuser password b4dp4ssw0rd port 433
  machine mailprovider.com login mailuser password worsepassword

#+end_src

The =auth-source-search= function can read this file and search for entries based on any of the details they contain:

#+begin_src emacs-lisp :tangle no

  (auth-source-search :host "facebook.com")
  (auth-source-search :host "mailprovider.com" :user "mailuser")
  (auth-source-search :host "mailprovider.com" :user "mailuser" :port 433)

#+end_src

The benefit of using =.authinfo= is that it's a file you have control over and can sync between systems (once encrypted!)  More easily portable than using one of the desktop environment keyrings.

*** Encrypting .authinfo

However, this file is plaintext by default, which is unsafe from a security standpoint!

Emacs uses GnuPG via the =epa= library to automatically encrypt and decrypt any files that end with =.gpg=, so we can create a file named =.authinfo.gpg= with the same contents to have them be encrypted on save.

[[https://www.gnu.org/software/emacs/manual/html_mono/epa.html][Emacs Manual: Easy PGP Assistant]] (=epa=)

*** Creating an encryption key

But first, we need to generate an encryption key!  The following command (in GPG 2.2 and above) will walk you through the process of creating a new key:

#+begin_src sh :tangle no

  gpg --full-generate-key

#+end_src

We need to answer some questions it asks us:

1. What kind of key do you want?  *(1) RSA and RSA (default)*
2. What keysize do you want? *4096*
3. How long should the key be valid? *0* (Key does not expire)
4. Enter your name
5. Enter your e-mail address
6. Enter a comment for the key (not necessary, but can be used to identify it)
7. If everything looks good, press *O* for "Okay"
8. You will now be prompted for a passphrase.  This is like a password for your encryption key, it should be secure and memorable!
9. After entering the password, it will generate the new key.  Move the mouse around or press keyboard keys to help generate entropy.

You should now have a new key that will show up when you run the following command:

#+begin_src sh

  gpg --list-keys

#+end_src

We can test this out by editing the new =~/.authinfo.gpg= file and then paste the contents from the original =~/.authinfo= file we created.

Once you save the =~/.authinfo.gpg= file, a new Emacs window will appear and you will be prompted for which key to use to encrypt the file:

#+begin_src sh

  Select recipients for encryption.
  If no one is selected, symmetric encryption will be performed.
  - ‘m’ to mark a key on the line
  - ‘u’ to unmark a key on the line
  [Cancel][OK]

#+end_src

If you only have one encryption key, this is all that will appear.  You merely need to move your keyboard cursor on top of the string =[OK]= and press enter.  You will be prompted for your passphrase to unlock the key and the file will be encrypted once you save it successfully.

 If you have more than one encryption key, they will be listed below the prompt:

#+begin_src sh

  Select recipients for encryption.
  If no one is selected, symmetric encryption will be performed.
  - ‘m’ to mark a key on the line
  - ‘u’ to unmark a key on the line
  [Cancel][OK]

    u FF0E73B64BBEB63F System Crafters (Password Encryption Key) <systemcrafterstest@gmail.com>
    u C0495F71F74DC5E9 David Wilson <david@systemcrafters.cc>

#+end_src

You will need to move your keyboard cursor to the line with the key you would like to use and press the letter =m= to mark the key, then move the cursor to =[OK]= and press Enter.  You will be prompted for your passphrase to unlock the key and the file will be encrypted once you save it successfully.

*** Verifying that it works

You can verify that the file is encrypted by trying to read it at the shell:

#+begin_src sh

  cat ~/.authinfo.gpg

#+end_src

You can also double-check that the passwords are accessible to =auth-source-search=:

#+begin_src emacs-lisp :tangle no

  (auth-source-search :host "facebook.com" :user "96801405")
  (auth-source-search :host "mailprovider.com" :user "mailuser")
  (auth-source-search :host "mailprovider.com" :user "mailuser" :port 433)

#+end_src

*** Starting gpg-agent

The =gpg-agent= manages access to your PGP keys and assists with encryption and decryption of files.  It can also cache your passphrase so that you don't get prompted for it every time you try to encrypt or decrypt a file.

Emacs' =epa= library may be able to automatically start it for you when you try to encrypt or decrypt a file.  If it doesn't, you may need to start it yourself!

We need to make sure the =gpg-agent= is running:

#+begin_src sh :tangle no

  # Check if gpg-agent is already running
  pgrep gpg-agent

  # If it's not running, you can start it up with this command:
  gpg-connect-agent /bye

#+end_src

In Ubuntu 20.04, it seems to be started as a user service.  If it isn't running by default in your system, you may need to add =gpg-connect-agent /bye= as a startup command in your desktop environment or however you start Xorg sessions.

*** Accessing passwords outside of Emacs

If you have Emacs running as a daemon or in server mode (see [[https://youtu.be/ZjCRxAMPdNc][my video]] on that) you can use =emacsclient= to access your passwords from other programs (like =mbsync=, etc).

First we'll create a helper function to add to our configuration to make this a little easier to call:

#+begin_src emacs-lisp

  (defun linas/lookup-password (&rest keys)
    (interactive)
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
        nil)))

#+end_src

Now you can invoke =emacsclient= in the shell to run this function and process the result:

#+begin_src sh

  emacsclient -e "(linas/lookup-password :host \"gmail.com\" :user \"linasvidz@gmail.com\")" | cut -d '"' -f2

#+end_src

Any program that can call an external shell application can now use this line to request the unencrypted password!  When the password is requested, you will be prompted for your passphrase if it has been a while since the last time you were asked.

For example, in the =mbsync= config from the Emacs Mail series:

#+begin_src conf

  PassCmd "emacsclient -e \"(linas/lookup-password :host \\\"gmail.com\\\" :user \\\"systemcrafters.test\\\")\" | cut -d '\"' -f2"

#+end_src

*** GPG Password input in Emacs
*Dependencies*
- pinentry-emacs

**** Enable emacs pinentry and loopback mode for gpg-agent
#+begin_src conf :tangle ~/.gnupg/gpg.conf :mkdirp yes

  use-agent 
  pinentry-mode loopback

#+end_src

#+begin_src conf :tangle ~/.gnupg/gpg-agent.conf :mkdirp yes

  # this means clients like Emacs can get the password in their own way and push to gpg
  # for this to work with Emacs, set epa-pinentry-mode to 'loopback in Emacs
  # allow-loopback-pinentry
  allow-emacs-pinentry

#+end_src

Then tell gpg-agent to load this configuration with ~gpgconf~ in shell:

#+begin_src shell

  gpgconf --reload gpg-agent

#+end_src

**** Configure EasyPG Assistant to use loopback for pinentry

#+begin_src emacs-lisp

  (setq epg-pinentry-mode 'loopback)

#+end_src

** Email
*** Syncing you mail
