Desktop.org
**** Configuring mbsync
Today we'll sync a Gmail account since they're pretty common. In another episode we'll show a more traditional IMAP account too.

We'll use a program called ~isync~ (in practice it's ~mbsync~!) to sync our mail. You can also use a program called ~offlineimap~, it's a bit slower but works on Windows too.

Void Linux install:
#+begin_src sh

  sudo xbps-install isync

#+end_src

Set up an initial configuration at ~/.mbsyncrc:

#+begin_src conf :tangle ~/.mbsyncrc
  IMAPAccount gmail
  Host imap.gmail.com
  User linasvidz@gmail.com
  PassCmd "emacsclient -e \"(linas/lookup-password :host \\\"gmail.com\\\" :user \\\"linasvidz@gmail.com\\\")\" | cut -d '\"' -f2"
  SSLType IMAPS
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore gmail-remote
  Account gmail

  MaildirStore gmail-local
  Subfolders Verbatim
  Path ~/Mail/linasvidz@gmail.com/
  Inbox ~/Mail/linasvidz@gmail.com/Inbox

  Channel gmail
  Master :gmail-remote:
  Slave :gmail-local:
  Patterns * ![Gmail]* "[Gmail]/Sent Mail" "[Gmail]/Starred" "[Gmail]/All Mail" "[Gmail]/Trash"
  Create Both
  SyncState *

  IMAPAccount school 
  Host outlook.office365.com
  Port 993
  User 254664@uis.no
  PassCmd "emacsclient -e \"(linas/lookup-password :host \\\"office365.com\\\" :user \\\"254664@uis.no\\\")\" | cut -d '\"' -f2"
  UseIMAPS yes
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore school-remote
  Account school 

  MaildirStore school-local
  Subfolders Verbatim
  Path ~/Mail/school/
  Inbox ~/Mail/school/Inbox

  Channel school
  Master :school-remote:
  Slave :school-local:
  # Include everything
  Patterns "INBOX" "*"
  # Automatically create missing mailboxes, both locally and on the server
  Create Both
  Sync All
  # Save the synchronization state files in the relevant directory
  SyncState *
#+end_src

**** Setting up mu to index the mailbox
Install ~mu4e~ package:

Void Linux:

#+begin_src sh

  sudo xbps-install mu4e

#+end_src

Run the initial index, providing your e-mail address so it knows how to identify you:

#+begin_src sh

  mu index --maildir=~/Mail --my-address=linasvidz@gmail.com

#+end_src

*** Managing Mail with mu4e

#+begin_src emacs-lisp

  (use-package mu4e
    :straight nil
    :load-path "/usr/share/emacs/site-lisp/mu4e/"
    :defer 10 ; Wait until 10 seconds after startup
    :config

    ;; Pull in org helpers
    (require 'mu4e-org)

    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 2 minutes
    (setq mu4e-update-interval (* 2 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")

    (setq mu4e-contexts
          (list
           ;; Main personal account
           (make-mu4e-context
            :name "linasvidz@gmail.com"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/linasvidz@gmail.com" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address . "linasvidz@gmail.com")
                    (user-full-name    . "Linas Vidziunas")
                    (mu4e-compose-signature  . "Linas Vidziunas")
                    (smtpmail-smtp-server  . "smtp.gmail.com")
                    (smtpmail-smtp-service  . 465)
                    (smtpmail-stream-type  . ssl)
                    (mu4e-drafts-folder  . "/linasvidz@gmail.com/[Gmail]/Drafts")
                    (mu4e-sent-folder  . "/linasvidz@gmail.com/[Gmail]/Sent Mail")
                    (mu4e-refile-folder  . "/linasvidz@gmail.com/[Gmail]/All Mail")
                    (mu4e-trash-folder  . "/linasvidz@gmail.com/[Gmail]/Trash")))

           ;; School account
           (make-mu4e-context
            :name "school"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/school" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address . "254664@uis.no")
                    (user-full-name    . "Linas Vidziunas")
                    (mu4e-compose-signature  . "Linas Vidzinas (254664)")
                    (smtpmail-smtp-server  . "smtp.office365.com")
                    (smtpmail-smtp-service  . 587)
                    (smtpmail-stream-type  . starttls)
                    (mu4e-drafts-folder  . "/school/Drafts")
                    (mu4e-sent-folder  . "/school/Sent Mail")
                    (mu4e-refile-folder  . "/school/All Mail")
                    (mu4e-trash-folder  . "/school/Trash")))))

    ;; Email Capture Templates
    (setq org-capture-templates
          `(("m" "Email Workflow")
            ("mf" "Follow Up" entry (file+olp "~/org/Mail.org" "Follow Up")
             "* TODO Follow up with %:fromname on %a\n    SCHEDULED:%t\n    DEADLINE:%(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n    <%:fromaddress> on %:date-timestamp\n\n\t%a\n\n\t%i"
             :immediate-finish t)
            ("mr" "Read Later" entry (file+olp "~/org/Mail.org" "Read Later")
             "* TODO Read %a\n    SCHEDULED:%t\n    DEADLINE:%(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n    <%:fromaddress> on %:date-timestamp\n\n\t%a\n\n\t%i"
             :immediate-finish t)))

    (defun linas/capture-mail-follow-up (msg)
      (interactive)
      (call-interactively 'org-store-link)
      (org-capture nil "mf"))

    (defun linas/capture-mail-read-later (msg)
      (interactive)
      (call-interactively 'org-store-link)
      (org-capture nil "mf"))

    (defun linas/store-link-to-mu4e-query ()
      (interactive)
      (let ((mu4e-org-link-query-in-headers-mode t))
        (call-interactively 'org-store-link)))

    ;; Add custom actions for our capture templates
    (add-to-list 'mu4e-headers-actions
                 '("follow up" . linas/capture-mail-follow-up) t)
    (add-to-list 'mu4e-view-actions
                 '("follow up" . linas/capture-mail-follow-up) t)
    (add-to-list 'mu4e-headers-actions
                 '("read later" . linas/capture-mail-read-later) t)
    (add-to-list 'mu4e-view-actions
                 '("read later" . linas/capture-mail-read-later) t)

    (setq mu4e-maildir-shortcuts
          '((:maildir "/linasvidz@gmail.com/Inbox"    :key ?i)
            (:maildir "/linasvidz@gmail.com/[Gmail]/Sent Mail" :key ?s)
            (:maildir "/linasvidz@gmail.com/[Gmail]/Trash"     :key ?t)
            (:maildir "/linasvidz@gmail.com/[Gmail]/Drafts"    :key ?d)
            (:maildir "/linasvidz@gmail.com/[Gmail]/All Mail"  :key ?a)))

    ;; Annoyingly the first mail has to be sent synchrounously
    (setq send-mail-function 'smtpmail-send-it)
    (setq message-send-mail-function 'smtpmail-send-it)

    ;; My attemt at async mail
    ;; (setq linas/smtp-to-async-smtp-mails-sent 0)
    ;; (defun linas/smtp-to-async-smtp ()
    ;;   (message "Message sent synchronously")
    ;;   ;; Why 2? how the fuck im I supposed to know
    ;;   (when (> linas/smtp-to-async-smtp-mails-sent 2)
    ;;     (require 'smtpmail-async)
    ;;     (message "Message sent asynchronously")
    ;;     (setq send-mail-function 'async-smtpmail-send-it)
    ;;     (setq message-send-mail-function 'async-smtpmail-send-it))
    ;;   (setq linas/smtp-to-async-smtp-mails-sent (+ linas/smtp-to-async-smtp-mails-sent 1)))

    ;; (add-hook 'message-sent-hook #'linas/smtp-to-async-smtp)

    ;; When enters main view picks the first context (first email)
    (setq mu4e-context-policy 'pick-first)

    ;; Make sure plain text mails flow correctly for recipients
    (setq mu4e-compose-format-flowed t)

    ;; Defaults
    ;; (setq mu4e-date-format-long "%c")
    ;; (setq mu4e-view-date-format "%c")
    ;; (setq mu4e-headers-long-date-format "%c")
    ;; (setq mu4e-headers-date-format "%x")
    (setq mu4e-headers-date-format "%d/%m/%y")

    (mu4e t))
#+end_src

*** Email

#+begin_src emacs-lisp

  (use-package mu4e-column-faces
    :after mu4e
    :config (mu4e-column-faces-mode))

#+end_src

