desktop.el

(use-package mu4e-alert
  :after mu4e
  :custom
  ;; Disable double notifications per email. annoying
  (mu4e-alert-email-notification-types '(subjects))
  :config
  (mu4e-alert-set-default-style 'libnotify)
  (mu4e-alert-enable-notifications))

;; mu4e-alert fix
;; Annoying but looks like dev is dead
(defun mu4e-alert--get-mu4e-frame ()
  "Try getting a frame containing a mu4e buffer."
  (car (delq nil (mapcar (lambda (buffer)
                           (when (and buffer
                                      (get-buffer-window buffer t))
                             (window-frame (get-buffer-window buffer t))))
                         (list mu4e-main-buffer-name)))))

(defun mu4e-alert-filter-repeated-mails (mails)
  "Filters the MAILS that have been seen already."
  (cl-remove-if (lambda (mail)
                  (prog1 (and (not mu4e-alert-notify-repeated-mails)
                              (ht-get mu4e-alert-repeated-mails
                                      (plist-get mail :message-id)))
                    (ht-set! mu4e-alert-repeated-mails
                             (plist-get mail :message-id)
                             t)
                    ))
                mails))

(use-package org-mime
  :after mu4e
  :custom
  (org-mime-export-options '(:section-numbers nil
                                              :with-author nil
                                              :with-toc nil))
  :config
  (add-hook 'message-send-hook 'org-mime-confirm-when-no-multipart))

(defun linas/proced-settings ()
  (setq proced-format (list 'pid 'tree 'pcpu 'pmem (list 'args 'comm)))
  (proced-toggle-tree t)
  (proced-toggle-auto-update t))

(use-package proced
  :straight nil
  :config
  (setq proced-auto-update-interval 1)
  (add-hook 'proced-mode-hook 'linas/proced-settings))
